
class DataTable(object):

	def __init__(self):

		# Переменные для хранения цветов
		self.gray = "#999999"
		self.green = "#00FF00"
		self.yellow = "#FFFF00"
		self.blue = "#00B8D9"
		self.red = "#FF0000"
		self.blue_violet = "#6666FF"
		self.violet = "#990099"

		# Базовая таблица с симптомами, диагнозами
		self.table1 = {
			"Загальні та неспецифічні":{"code":"A","data":[
				{"code":"A01","text":"Біль загальний / множинної локалізації","color":"#00FF00"},
				{"code":"A02","text":"Озноб","color":"#00FF00"},
				{"code":"A03","text":"Лихоманка","color":"#00FF00"},
				{"code":"A04","text":"Загальна слабкість/втома","color":"#00FF00"},
				{"code":"A05","text":"Нездужання","color":"#00FF00"},
				{"code":"A06","text":"Втрата свідомості/непритомність","color":"#00FF00"},
				{"code":"A07","text":"Кома","color":"#00FF00"},
				{"code":"A08","text":"Припухлість","color":"#00FF00"},
				{"code":"A09","text":"Проблеми потовиділення","color":"#00FF00"},
				{"code":"A10","text":"Кровотеча / геморагія БДУ","color":"#00FF00"},
				{"code":"A11","text":"Біль у грудях БДУ","color":"#00FF00"},
				{"code":"A13","text":"Занепокоєння /страх, пов’язані з лікуванням","color":"#00FF00"},
				{"code":"A16","text":"Неспокійна дитина","color":"#00FF00"},
				{"code":"A18","text":"Занепокоєння з приводу зовнішності","color":"#00FF00"},
				{"code":"A20","text":"Прохання про евтаназію / обговорення","color":"#00FF00"},
				{"code":"A21","text":"Фактор ризику розвитку злоякісних пухлин","color":"#00FF00"},
				{"code":"A23","text":"Фактор ризику БДУ","color":"#00FF00"},
				{"code":"A25","text":"Страх смерті / вмирання","color":"#00FF00"},
				{"code":"A26","text":"Страх захворіти на рак БДУ","color":"#00FF00"},
				{"code":"A27","text":"Страх захворіти на іншу хворобу БДУ","color":"#00FF00"},
				{"code":"A28","text":"ОФ / Н БДУ","color":"#00FF00"},
				{"code":"A29","text":"Інші загальні симптоми / скарги","color":"#00FF00"},
				
				{"code":"A70","text":"Туберкульоз","color":"#FFFF00"},
				{"code":"A71","text":"Кір","color":"#FFFF00"},
				{"code":"A72","text":"Вітряна віспа","color":"#FFFF00"},
				{"code":"A73","text":"Малярія","color":"#FFFF00"},
				{"code":"A74","text":"Краснуха","color":"#FFFF00"},
				{"code":"A75","text":"Інфекційний мононуклеоз","color":"#FFFF00"},
				{"code":"A76","text":"Інші вірусні екзантеми","color":"#FFFF00"},
				{"code":"A77","text":"Вірусні захворювання інші / БДУ","color":"#FFFF00"},
				{"code":"A78","text":"Інфекційні захворювання інші / БДУ","color":"#FFFF00"},
				
				{"code":"A79","text":"Злоякісне новоутворення БДУ","color":"#00B8D9"},
				
				{"code":"A80","text":"Травма / пошкодження БДУ","color":"#FF0000"},
				{"code":"A81","text":"Численні травми / пошкодження","color":"#FF0000"},
				{"code":"A82","text":"Вторинний наслідок травми","color":"#FF0000"},
				{"code":"A84","text":"Отруєння медикаментами","color":"#FF0000"},
				{"code":"A85","text":"Побічна дія медикаментів","color":"#FF0000"},
				{"code":"A86","text":"Немедикаментозне отруєння","color":"#FF0000"},
				{"code":"A87","text":"Ускладнення лікування","color":"#FF0000"},
				{"code":"A88","text":"Побічна дія фізичного чинника","color":"#FF0000"},
				{"code":"A89","text":"Наслідки протезування","color":"#FF0000"},
				{"code":"A90","text":"Вроджена аномалія БДУ / декілька","color":"#FF0000"},
				
				{"code":"A91","text":"Анормальні результати досліджень БДУ","color":"#6666FF"},
				
				{"code":"A92","text":"Алергія / алергічна реакція БДУ","color":"#990099"},
				{"code":"A93","text":"Передчасно народжена дитина","color":"#990099"},
				{"code":"A94","text":"Інші перинатальні захворювання","color":"#990099"},
				{"code":"A95","text":"Перинатальна смертність","color":"#990099"},
				{"code":"A96","text":"Смерть","color":"#990099"},
				{"code":"A97","text":"Відсутність хвороби","color":"#990099"},
				{"code":"A98","text":"Підтримання здоров'я / профілактика","color":"#990099"},
				{"code":"A99","text":"Захворювання / стан неуточненої природи","color":"#990099"}
			]},
			"Кров, кровотворні органи та імунна система":{"code":"B","data":[
				{"code":"B02","text":"Лімфат. вузол(ли) збільшений/болючий","color":"#00FF00"},
				{"code":"B04","text":"Симптоми/скарги (кров, лімф.орг.)","color":"#00FF00"},
				{"code":"B25","text":"Страх ВІЛ/СНІД","color":"#00FF00"},
				{"code":"B26","text":"Страх захворіти на рак крові / лімф. орг.","color":"#00FF00"},
				{"code":"B27","text":"Страх ін. захв. крові / лімф. орг.","color":"#00FF00"},
				{"code":"B28","text":"ОФ / Н (В)","color":"#00FF00"},
				{"code":"B29","text":"Інші симптоми /скарги","color":"#00FF00"},

				{"code":"B70","text":"Лімфаденіт гострий","color":"#FFFF00"},
				{"code":"B70","text":"Лімфаденіт хрон. неспецифічний","color":"#FFFF00"},

				{"code":"B72","text":"Хвороба Ходжкіна / лімфома","color":"#00B8D9"},
				{"code":"B73","text":"Лейкемія","color":"#00B8D9"},
				{"code":"B74","text":"Злоякісне новоутворення крові ін.","color":"#00B8D9"},
				{"code":"B75","text":"Доброякісне / невизначене новоутв. крові","color":"#00B8D9"},
				
				{"code":"B76","text":"Розрив селезінки травматичний","color":"#FF0000"},
				{"code":"B77","text":"Інші ушкодження крові / лімф./селезінки","color":"#FF0000"},
				
				{"code":"B78","text":"Спадкова гемолітична анемія","color":"#6666FF"},
				{"code":"B79","text":"Інші вроджені вади крові / лімф. орг.","color":"#6666FF"},
				
				{"code":"B80","text":"Залізодефіцитна анемія","color":"#990099"},
				{"code":"B81","text":"В12/фолієво дефіцитна анемія","color":"#990099"},
				{"code":"B82","text":"Інша /невизначена анемія","color":"#990099"},
				{"code":"B83","text":"Пурпура / порушення коагуляції","color":"#990099"},
				{"code":"B84","text":"Нез'ясовні зміни лейкоцитів","color":"#990099"},
				{"code":"B87","text":"Спленомегалія","color":"#990099"},
				{"code":"B90","text":"ВІЛ-інфекція/СНІД","color":"#990099"},
				{"code":"B99","text":"Інші захворювання (кров, лімф.орг.,селез)","color":"#990099"}
			]},
			"Травна система":{"code":"D","data":[
				{"code":"D01","text":"Біль у животі /кольки без локалізації","color":"#00FF00"},
				{"code":"D02","text":"Біль в епігастральній ділянці","color":"#00FF00"},
				{"code":"D03","text":"Печія","color":"#00FF00"},
				{"code":"D04","text":"Ректальний /анальний біль","color":"#00FF00"},
				{"code":"D05","text":"Перианальний свербіж","color":"#00FF00"},
				{"code":"D06","text":"Біль у животі локалізований інший","color":"#00FF00"},
				{"code":"D07","text":"Диспепсія / розлад травлення","color":"#00FF00"},
				{"code":"D08","text":"Метеоризм/ гази / відрижка","color":"#00FF00"},
				{"code":"D09","text":"Нудота","color":"#00FF00"},
				{"code":"D10","text":"Блювота","color":"#00FF00"},
				{"code":"D11","text":"Діарея","color":"#00FF00"},
				{"code":"D12","text":"Закреп","color":"#00FF00"},
				{"code":"D13","text":"Жовтяниця","color":"#00FF00"},
				{"code":"D14","text":"Блювання кров'ю","color":"#00FF00"},
				{"code":"D15","text":"Мелена","color":"#00FF00"},
				{"code":"D16","text":"Ректальна кровотеча","color":"#00FF00"},
				{"code":"D17","text":"Нетримання калу","color":"#00FF00"},
				{"code":"D18","text":"Зміна калу/моторики","color":"#00FF00"},
				{"code":"D19","text":"Зуби /ясна симптоми / скарги","color":"#00FF00"},
				{"code":"D20","text":"Рот/язик/губи симптоми/скарги","color":"#00FF00"},
				{"code":"D21","text":"Проблеми ковтання","color":"#00FF00"},
				{"code":"D23","text":"Гепатомегалія","color":"#00FF00"},
				{"code":"D24","text":"Абдомінальне об'ємне утворення БДУ","color":"#00FF00"},
				{"code":"D25","text":"Здуття живота","color":"#00FF00"},
				{"code":"D26","text":"Страх захворіти на рак травної системи","color":"#00FF00"},
				{"code":"D27","text":"Страх перед ін. хворобами травної с-ми","color":"#00FF00"},
				{"code":"D28","text":"ОФ / Н (D)","color":"#00FF00"},
				{"code":"D29","text":"Інші симптоми / скарги","color":"#00FF00"},

				{"code":"D70","text":"Шлунково-кишкова інфекція","color":"#FFFF00"},
				{"code":"D71","text":"Епідемічний паротит","color":"#FFFF00"},
				{"code":"D72","text":"Вірусний гепатит","color":"#FFFF00"},
				{"code":"D73","text":"Гастроентерит імовірно інф. походження","color":"#FFFF00"},

				{"code":"D74","text":"Злоякісне новоутворення шлунку","color":"#00B8D9"},
				{"code":"D75","text":"Злоякісне новоутв. товстої / прямої кишки","color":"#00B8D9"},
				{"code":"D76","text":"Злоякісне новоутв. підшлункової залози","color":"#00B8D9"},
				{"code":"D77","text":"Злоякісне новоутв. травн. с-ми інші / БДУ","color":"#00B8D9"},
				{"code":"D78","text":"Доброякісне/неуточнене новоутворення","color":"#00B8D9"},

				{"code":"D79","text":"Стороннє тіло травної системи","color":"#FF0000"},
				{"code":"D80","text":"Інша травма травної системи","color":"#FF0000"},

				{"code":"D81","text":"Вроджена аномалія травної системи","color":"#6666FF"},

				{"code":"D82","text":"Захворювання зубів / ясен","color":"#990099"},
				{"code":"D83","text":"Захворювання роту / язика / губ","color":"#990099"},
				{"code":"D84","text":"Захворювання стравоходу","color":"#990099"},
				{"code":"D85","text":"Виразка дванадцятипалої кишки","color":"#990099"},
				{"code":"D86","text":"Виразкова хвороба ін.","color":"#990099"},
				{"code":"D87","text":"Розлад функції шлунку","color":"#990099"},
				{"code":"D88","text":"Апендицит","color":"#990099"},
				{"code":"D89","text":"Пахова грижа","color":"#990099"},
				{"code":"D90","text":"Грижа стравохідного отвору діафрагми","color":"#990099"},
				{"code":"D91","text":"Черевна грижа ін.","color":"#990099"},
				{"code":"D92","text":"Дивертикульоз","color":"#990099"},
				{"code":"D93","text":"Синдром подразненої товстої кишки","color":"#990099"},
				{"code":"D94","text":"Хронічний ентерит / виразковий коліт","color":"#990099"},
				{"code":"D95","text":"Анальна тріщина / періанальнй абсцес","color":"#990099"},
				{"code":"D96","text":"Гельмінти / інші паразити","color":"#990099"},
				{"code":"D97","text":"Захворювання печінки БДУ","color":"#990099"},
				{"code":"D98","text":"Холецистит / жовчнокам'яна хвороба","color":"#990099"},
				{"code":"D99","text":"Хвороба системи травлення, ін.","color":"#990099"}
			]},
			"Око":{"code":"F","data":[
				{"code":"F01","text":"Біль в оці","color":"#00FF00"},
				{"code":"F02","text":"Червоне око","color":"#00FF00"},
				{"code":"F03","text":"Виділення з ока","color":"#00FF00"},
				{"code":"F04","text":"Візуальні плаваючі мушки / плями","color":"#00FF00"},
				{"code":"F05","text":"Порушення зору інші","color":"#00FF00"},
				{"code":"F13","text":"Анормальні відчуття в очах","color":"#00FF00"},
				{"code":"F14","text":"Анормальні рухи очей","color":"#00FF00"},
				{"code":"F15","text":"Анормальний вигляд очей","color":"#00FF00"},
				{"code":"F16","text":"Повіки симптоми/скарги","color":"#00FF00"},
				{"code":"F17","text":"Окуляри симптоми/скарги","color":"#00FF00"},
				{"code":"F18","text":"Контактні лінзи симптоми/скарги","color":"#00FF00"},
				{"code":"F27","text":"Страх перед хворобою очей","color":"#00FF00"},
				{"code":"F28","text":"ОФ/Н (F)","color":"#00FF00"},
				{"code":"F29","text":"Око симптоми/скарги інші","color":"#00FF00"},

				{"code":"F70","text":"Кон'юнктивіт інфекційний","color":"#FFFF00"},
				{"code":"F71","text":"Кон'юнктивіт алергічний","color":"#FFFF00"},
				{"code":"F72","text":"Блефарит / ячмінь / халазион","color":"#FFFF00"},
				{"code":"F73","text":"Очні інфекції / запалення інші","color":"#FFFF00"},

				{"code":"F74","text":"Новоутворення очей / придатків","color":"#00B8D9"},

				{"code":"F75","text":"Контузія / крововилив ока","color":"#FF0000"},
				{"code":"F76","text":"Стороннє тіло в оці","color":"#FF0000"},
				{"code":"F79","text":"Травма очей ін.","color":"#FF0000"},

				{"code":"F80","text":"Непрохідність слізного протоку дитини","color":"#6666FF"},
				{"code":"F81","text":"Вроджені аномалії очей інші","color":"#6666FF"},

				{"code":"F82","text":"Відшарування сітківки","color":"#990099"},
				{"code":"F83","text":"Ретинопатія","color":"#990099"},
				{"code":"F84","text":"Макулодистрофія","color":"#990099"},
				{"code":"F85","text":"Виразка рогівки","color":"#990099"},
				{"code":"F86","text":"Трахома","color":"#990099"},
				{"code":"F91","text":"Порушення рефракції","color":"#990099"},
				{"code":"F92","text":"Катаракта","color":"#990099"},
				{"code":"F93","text":"Глаукома","color":"#990099"},
				{"code":"F94","text":"Сліпота","color":"#990099"},
				{"code":"F95","text":"Косоокість","color":"#990099"},
				{"code":"F99","text":"Захворювання ока/придатків, інші","color":"#990099"}
			]},
			"Вухо":{"code":"H","data":[
				{"code":"H01","text":"Біль у вусі / оталгія","color":"#00FF00"},
				{"code":"H02","text":"Скарги на порушення слуху","color":"#00FF00"},
				{"code":"H03","text":"Дзвін /шум у вухах","color":"#00FF00"},
				{"code":"H04","text":"Виділення з вуха","color":"#00FF00"},
				{"code":"H05","text":"Кровотеча з вуха","color":"#00FF00"},
				{"code":"H13","text":"Відчуття закладеного вуха","color":"#00FF00"},
				{"code":"H15","text":"Стурбованість зовнішнім виглядом вух","color":"#00FF00"},
				{"code":"H27","text":"Страх хвороби вуха","color":"#00FF00"},
				{"code":"H28","text":"ОФ/Н (Н)","color":"#00FF00"},
				{"code":"H29","text":"Вушні симптоми/скарги інші","color":"#00FF00"},

				{"code":"H70","text":"Зовнішній отит","color":"#FFFF00"},
				{"code":"H71","text":"Гострий середній отит / мірингіт","color":"#FFFF00"},
				{"code":"H72","text":"Серозний середній отит","color":"#FFFF00"},
				{"code":"H73","text":"Сальпінгіт євстахієвої труби","color":"#FFFF00"},
				{"code":"H74","text":"Хронічний середній отит","color":"#FFFF00"},

				{"code":"H75","text":"Новоутворення вуха","color":"#00B8D9"},

				{"code":"H76","text":"Стороннє тіло у вусі","color":"#FF0000"},
				{"code":"H77","text":"Перфорація барабанної перетинки","color":"#FF0000"},
				{"code":"H78","text":"Травма зовнішнього вуха","color":"#FF0000"},
				{"code":"H79","text":"Травми вуха інші","color":"#FF0000"},

				{"code":"H80","text":"Вроджена аномалія вуха","color":"#6666FF"},

				{"code":"H81","text":"Надмірна секреція вушної сірки","color":"#990099"},
				{"code":"H82","text":"Синдром запаморочення","color":"#990099"},
				{"code":"H83","text":"Отосклероз","color":"#990099"},
				{"code":"H84","text":"Пресбіакузис","color":"#990099"},
				{"code":"H85","text":"Акустична травма","color":"#990099"},
				{"code":"H86","text":"Глухота","color":"#990099"},
				{"code":"H99","text":"Захворювання вуха інші","color":"#990099"}
			]},
			"Серцево-судинна система":{"code":"K","data":[
				{"code":"K01","text":"Біль у серці","color":"#00FF00"},
				{"code":"K02","text":"Стиснення в обл. серця","color":"#00FF00"},
				{"code":"K03","text":"Біль пов’язаний з ССС БДУ","color":"#00FF00"},
				{"code":"K04","text":"Серцебиття","color":"#00FF00"},
				{"code":"K05","text":"Порушення серцевого ритму інші","color":"#00FF00"},
				{"code":"K06","text":"Незвично помітні вени","color":"#00FF00"},
				{"code":"K07","text":"Опухлі щиколотки / набряки","color":"#00FF00"},
				{"code":"K22","text":"Фактор ризику ХСК","color":"#00FF00"},
				{"code":"K24","text":"Страх перед хворобою серця","color":"#00FF00"},
				{"code":"K25","text":"Страх гіпертонії","color":"#00FF00"},
				{"code":"K27","text":"Страх інших ХСК","color":"#00FF00"},
				{"code":"K28","text":"ОФ/Н (K)","color":"#00FF00"},
				{"code":"K29","text":"Інші симптоми/скарги ССС","color":"#00FF00"},

				{"code":"K70","text":"Інфекції системи кровообігу","color":"#FFFF00"},
				{"code":"K71","text":"Гостра ревм. лихоманка/хвороба серця","color":"#FFFF00"},

				{"code":"K72","text":"Новоутворення ССС","color":"#00B8D9"},

				{"code":"K73","text":"Вроджена аномалія ССС","color":"#6666FF"},

				{"code":"K74","text":"ІХС із стенокардією","color":"#990099"},
				{"code":"K75","text":"Гострий інфаркт міокарда","color":"#990099"},
				{"code":"K76","text":"ІХС без стенокардії","color":"#990099"},
				{"code":"K77","text":"Серцева недостатність","color":"#990099"},
				{"code":"K78","text":"Фібриляції передсердь / миготіння","color":"#990099"},
				{"code":"K79","text":"Пароксизмальна тахікардія","color":"#990099"},
				{"code":"K80","text":"Серцева аритмія БДУ","color":"#990099"},
				{"code":"K81","text":"Серцевий /артеріальний шум БДУ","color":"#990099"},
				{"code":"K82","text":"Легенево-серцева недостатність","color":"#990099"},
				{"code":"K83","text":"Захворювання клапану серця БДУ","color":"#990099"},
				{"code":"K84","text":"Хвороби серця інші","color":"#990099"},
				{"code":"K85","text":"Підвищений артеріальний тиск","color":"#990099"},
				{"code":"K86","text":"Гіпертонія неускладнена","color":"#990099"},
				{"code":"K87","text":"Гіпертонія з ускладненням","color":"#990099"},
				{"code":"K88","text":"Постуральна гіпотензія","color":"#990099"},
				{"code":"K89","text":"Транзиторна ішемія головного мозку","color":"#990099"},
				{"code":"K90","text":"Інсульт / порушення мозкового кровообігу","color":"#990099"},
				{"code":"K91","text":"Захворювання судин мозку","color":"#990099"},
				{"code":"K92","text":"Атеросклероз / захворювання периф. судин","color":"#990099"},
				{"code":"K93","text":"Легенева емболія","color":"#990099"},
				{"code":"K94","text":"Флебіт / тромбофлебіт","color":"#990099"},
				{"code":"K95","text":"Варикозне розширення вен ніг","color":"#990099"},
				{"code":"K96","text":"Геморой","color":"#990099"},
				{"code":"K99","text":"Захворювання (К) інші","color":"#990099"}
			]},
			"Опорно-рухова система":{"code":"L","data":[
				{"code":"L01","text":"Шия - симптоми/скарги","color":"#00FF00"},
				{"code":"L02","text":"Спина - симптоми/скарги","color":"#00FF00"},
				{"code":"L03","text":"Поперек - симптоми/скарги","color":"#00FF00"},
				{"code":"L04","text":"Грудна клітина - симптоми/скарги","color":"#00FF00"},
				{"code":"L05","text":"Бік/пахвова западина - симптоми /скарги","color":"#00FF00"},
				{"code":"L07","text":"Щелепа - симптоми/скарги","color":"#00FF00"},
				{"code":"L08","text":"Плече - симптоми/скарги","color":"#00FF00"},
				{"code":"L09","text":"Рука - симптоми/скарги","color":"#00FF00"},
				{"code":"L10","text":"Лікоть - симптоми/скарги","color":"#00FF00"},
				{"code":"L11","text":"Зап'ястя - симптоми/скарги","color":"#00FF00"},
				{"code":"L12","text":"Кисть/палець - симптоми/скарги","color":"#00FF00"},
				{"code":"L13","text":"Таз - симптоми/скарги","color":"#00FF00"},
				{"code":"L14","text":"Гомілка/стегно - симптоми/скарги","color":"#00FF00"},
				{"code":"L15","text":"Коліно - симптоми/скарги","color":"#00FF00"},
				{"code":"L16","text":"Щиколотка - симптоми/скарги","color":"#00FF00"},
				{"code":"L17","text":"Стопа /палець ноги - симптоми/скарги","color":"#00FF00"},
				{"code":"L18","text":"М'язовий біль","color":"#00FF00"},
				{"code":"L19","text":"М'язи - симптоми/скарги БДУ","color":"#00FF00"},
				{"code":"L20","text":"Суглоб - симптоми/скарги БДУ","color":"#00FF00"},
				{"code":"L26","text":"Страх захворіти на рак (L)","color":"#00FF00"},
				{"code":"L27","text":"Страх іншого захворювання (L)","color":"#00FF00"},
				{"code":"L28","text":"ОФ / Н (L)","color":"#00FF00"},
				{"code":"L29","text":"Симптоми /скарги (L) інші","color":"#00FF00"},

				{"code":"L70","text":"Інфекції опорно-рухової системи","color":"#FFFF00"},

				{"code":"L71","text":"Злоякісні новоутворення (L)","color":"#00B8D9"},

				{"code":"L72","text":"Перелом: променевої/ліктьової кістки","color":"#FF0000"},
				{"code":"L73","text":"Перелом: гомілкової/малогомілк. кістки","color":"#FF0000"},
				{"code":"L74","text":"Перелом: кисть/стопа","color":"#FF0000"},
				{"code":"L75","text":"Перелом: стегна","color":"#FF0000"},
				{"code":"L76","text":"Перелом: інші","color":"#FF0000"},
				{"code":"L77","text":"Р/Д гомілковостопного суглоба","color":"#FF0000"},
				{"code":"L78","text":"Р/Д колінного суглоба","color":"#FF0000"},
				{"code":"L79","text":"Р/Д суглобу БДУ","color":"#FF0000"},
				{"code":"L80","text":"Вивих /підвивих","color":"#FF0000"},
				{"code":"L81","text":"Травма опорно-рухової системи БДУ","color":"#FF0000"},

				{"code":"L82","text":"Вроджена аномалія опорно-рухової сист.","color":"#6666FF"},

				{"code":"L83","text":"Шийний синдром","color":"#990099"},
				{"code":"L84","text":"Спинний синдром без іррадіації болю","color":"#990099"},
				{"code":"L85","text":"Набута деформація хребта","color":"#990099"},
				{"code":"L86","text":"Спинний синдром з іррадіацію болю","color":"#990099"},
				{"code":"L87","text":"Бурсит /тендиніт /синовіт БДУ","color":"#990099"},
				{"code":"L88","text":"Ревматоїдний / серопозитивний артрит","color":"#990099"},
				{"code":"L89","text":"Остеоартроз кульшового суглоба","color":"#990099"},
				{"code":"L90","text":"Остеоартроз колінного суглоба","color":"#990099"},
				{"code":"L91","text":"Остеоартроз ін.","color":"#990099"},
				{"code":"L92","text":"Плечовий синдром","color":"#990099"},
				{"code":"L93","text":"Латеральний епікондиліт (тенісн. лікоть)","color":"#990099"},
				{"code":"L94","text":"Остеохондроз","color":"#990099"},
				{"code":"L95","text":"Остеопороз","color":"#990099"},
				{"code":"L96","text":"Гостре внутрішнє ушкодження коліна","color":"#FF0000"},
				{"code":"L97","text":"Новоутворення доброякісне / неуточн.","color":"#00B8D9"},
				{"code":"L98","text":"Набута деформація кінцівки","color":"#990099"},
				{"code":"L99","text":"Захворювання (L) інші","color":"#990099"}
			]},
			"Нервова система":{"code":"N","data":[
				{"code":"N01","text":"Головний біль","color":"#00FF00"},
				{"code":"N03","text":"Біль в області обличчя","color":"#00FF00"},
				{"code":"N04","text":"Синдром неспокійних ніг","color":"#00FF00"},
				{"code":"N05","text":"Поколювання пальців рук / ніг, ступнів","color":"#00FF00"},
				{"code":"N06","text":"Порушення чутливості інші","color":"#00FF00"},
				{"code":"N07","text":"Судоми / припадок","color":"#00FF00"},
				{"code":"N08","text":"Анормальні мимовільні рухи","color":"#00FF00"},
				{"code":"N16","text":"Порушення нюху /смаку","color":"#00FF00"},
				{"code":"N17","text":"Втрачання рівноваги / запаморочення","color":"#00FF00"},
				{"code":"N18","text":"Параліч / слабкість","color":"#00FF00"},
				{"code":"N19","text":"Розлад мовлення","color":"#00FF00"},
				{"code":"N26","text":"Страх захворіти на рак нервової системи","color":"#00FF00"},
				{"code":"N27","text":"Страх перед ін. захворюваннями (N)","color":"#00FF00"},
				{"code":"N28","text":"ОФ / Н (N)","color":"#00FF00"},
				{"code":"N29","text":"Неврологічні симптоми / скарги інші","color":"#00FF00"},

				{"code":"N70","text":"Поліомієліт","color":"#FFFF00"},
				{"code":"N71","text":"Менінгіт / енцефаліт","color":"#FFFF00"},
				{"code":"N72","text":"Правець","color":"#FFFF00"},
				{"code":"N73","text":"Неврологічна інфекція інша","color":"#FFFF00"},

				{"code":"N74","text":"Злоякісне новоутворення (N)","color":"#00B8D9"},
				{"code":"N75","text":"Доброякісне новоутворення (N)","color":"#00B8D9"},
				{"code":"N76","text":"Новоутворення неуточнене (N)","color":"#00B8D9"},

				{"code":"N79","text":"Струс мозку","color":"#FF0000"},
				{"code":"N80","text":"Черепно-мозкова травма інша","color":"#FF0000"},
				{"code":"N81","text":"Травма нервової системи інша","color":"#FF0000"},

				{"code":"N85","text":"Вроджена аномалія (N)","color":"#6666FF"},

				{"code":"N86","text":"Розсіяний склероз","color":"#990099"},
				{"code":"N87","text":"Паркінсонізм","color":"#990099"},
				{"code":"N88","text":"Епілепсія","color":"#990099"},
				{"code":"N89","text":"Мігрень","color":"#990099"},
				{"code":"N90","text":"Кластерний головний біль","color":"#990099"},
				{"code":"N91","text":"Лицьовий параліч / параліч Белла","color":"#990099"},
				{"code":"N92","text":"Невралгія трійчастого нерву","color":"#990099"},
				{"code":"N93","text":"Тунельний синдром зап'ястя","color":"#990099"},
				{"code":"N94","text":"Периферичний неврит / нейропатія","color":"#990099"},
				{"code":"N95","text":"Головний біль напруги","color":"#990099"},
				{"code":"N99","text":"Неврологічні захворювання, інші","color":"#990099"}
			]},
			"Психологічні":{"code":"P","data":[
				{"code":"P01","text":"Відчуття тривоги/нервування/напруженості","color":"#00FF00"},
				{"code":"P02","text":"Гостра реакція на стрес","color":"#00FF00"},
				{"code":"P03","text":"Пригнічений настрій","color":"#00FF00"},
				{"code":"P04","text":"Відчуття /поведінка роздратованості /злості","color":"#00FF00"},
				{"code":"P05","text":"Старість, відчуття/поведінка старої людини","color":"#00FF00"},
				{"code":"P06","text":"Порушення сну","color":"#00FF00"},
				{"code":"P07","text":"Зниження сексуального потягу","color":"#00FF00"},
				{"code":"P08","text":"Зниження сексуального задоволення","color":"#00FF00"},
				{"code":"P09","text":"Стурбованість щодо сексуальних уподобань","color":"#00FF00"},
				{"code":"P10","text":"Заїкання /запинання/ тик","color":"#00FF00"},
				{"code":"P11","text":"Проблема харчування у дитини","color":"#00FF00"},
				{"code":"P12","text":"Нетримання сечі / енурез","color":"#00FF00"},
				{"code":"P13","text":"Енкопрез /проблема тренування кишківника","color":"#00FF00"},
				{"code":"P15","text":"Хронічне зловживання алкоголем","color":"#00FF00"},
				{"code":"P16","text":"Гостра алкогольна інтоксикація","color":"#00FF00"},
				{"code":"P17","text":"Зловживання тютюном","color":"#00FF00"},
				{"code":"P18","text":"Зловживання ліками","color":"#00FF00"},
				{"code":"P19","text":"Вживання наркотиків","color":"#00FF00"},
				{"code":"P20","text":"Порушення пам'яті","color":"#00FF00"},
				{"code":"P22","text":"Дитяча поведінка - симптом / скарга","color":"#00FF00"},
				{"code":"P23","text":"Підліткова поведінка - симптом / скарга","color":"#00FF00"},
				{"code":"P24","text":"Специфічна проблема навчання","color":"#00FF00"},
				{"code":"P25","text":"Проблема фази життя дорослого","color":"#00FF00"},
				{"code":"P27","text":"Страх психічного розладу","color":"#00FF00"},
				{"code":"P28","text":"ОФ/Н (P)","color":"#00FF00"},
				{"code":"P29","text":"Психологічні симптоми/скарги інші","color":"#00FF00"},

				{"code":"P70","text":"Слабоумство (Деменція)","color":"#990099"},
				{"code":"P71","text":"Органічні психози інші","color":"#990099"},
				{"code":"P72","text":"Шизофренія","color":"#990099"},
				{"code":"P73","text":"Афективний психоз","color":"#990099"},
				{"code":"P74","text":"Тривожний розлад","color":"#990099"},
				{"code":"P75","text":"Психосоматичний розлад","color":"#990099"},
				{"code":"P76","text":"Депресивний розлад","color":"#990099"},
				{"code":"P77","text":"Самогубство / спроба самогубства","color":"#990099"},
				{"code":"P78","text":"Неврастенія / перевтома","color":"#990099"},
				{"code":"P79","text":"Фобія / компульсивний розлад","color":"#990099"},
				{"code":"P80","text":"Розлад особистості","color":"#990099"},
				{"code":"P81","text":"Гіперкінетичний розлад","color":"#990099"},
				{"code":"P82","text":"Посттравматичний стрес","color":"#990099"},
				{"code":"P85","text":"Затримка розумового розвитку","color":"#990099"},
				{"code":"P86","text":"Нервова анорексія / булімія","color":"#990099"},
				{"code":"P98","text":"Психоз БДУ / ін.","color":"#990099"},
				{"code":"P99","text":"Психологічні розлади, інші","color":"#990099"}
			]},
			"Дихальна система":{"code":"R","data":[
				{"code":"R01","text":"Біль в дихальній системі","color":"#00FF00"},
				{"code":"R02","text":"Задишка / утруднене дихання","color":"#00FF00"},
				{"code":"R03","text":"Дихання з присвистом","color":"#00FF00"},
				{"code":"R04","text":"Проблема з диханням, ін.","color":"#00FF00"},
				{"code":"R05","text":"Кашель","color":"#00FF00"},
				{"code":"R06","text":"Кровотеча з носа","color":"#00FF00"},
				{"code":"R07","text":"Чхання / закладеність носа","color":"#00FF00"},
				{"code":"R08","text":"Ніс - симптом / скарга ін.","color":"#00FF00"},
				{"code":"R09","text":"Синуси - симптом / скарга","color":"#00FF00"},
				{"code":"R21","text":"Горло - симптом / скарга","color":"#00FF00"},
				{"code":"R23","text":"Голос - симптом / скарга","color":"#00FF00"},
				{"code":"R24","text":"Кровохаркання","color":"#00FF00"},
				{"code":"R25","text":"Анормальне мокротиння/слиз","color":"#00FF00"},
				{"code":"R26","text":"Страх захворіти нарак дихальної системи","color":"#00FF00"},
				{"code":"R27","text":"Страх респіраторних захворювань, ін.","color":"#00FF00"},
				{"code":"R28","text":"ОФ / Н (R)","color":"#00FF00"},
				{"code":"R29","text":"Дихальна система - симптом / скарга ін.","color":"#00FF00"},

				{"code":"R71","text":"Кашлюк","color":"#FFFF00"},
				{"code":"R72","text":"Стрептококова інфекція горла","color":"#FFFF00"},
				{"code":"R73","text":"Фурункул/абсцес носа","color":"#FFFF00"},
				{"code":"R74","text":"Гостра інфекція верхніх дихальних шляхів","color":"#FFFF00"},
				{"code":"R75","text":"Синусит гострий / хронічний","color":"#FFFF00"},
				{"code":"R76","text":"Гострий тонзиліт","color":"#FFFF00"},
				{"code":"R77","text":"Гострий ларингіт / трахеїт","color":"#FFFF00"},
				{"code":"R78","text":"Гострий бронхіт / бронхіоліт","color":"#FFFF00"},
				{"code":"R79","text":"Хронічний бронхіт","color":"#FFFF00"},
				{"code":"R80","text":"Грип","color":"#FFFF00"},
				{"code":"R81","text":"Пневмонія","color":"#FFFF00"},
				{"code":"R82","text":"Плеврит/ексудативний плеврит","color":"#FFFF00"},
				{"code":"R83","text":"Респіраторні інфекції інші","color":"#FFFF00"},

				{"code":"R84","text":"Злоякісне новоутворення бронхів / легень","color":"#00B8D9"},
				{"code":"R85","text":"Злоякісне новоутв. в органах дихання, ін.","color":"#00B8D9"},
				{"code":"R86","text":"Доброякісне новоутворення органів дихання","color":"#00B8D9"},

				{"code":"R87","text":"Стороннє тіло в носі/гортані/бронхах","color":"#FF0000"},
				{"code":"R88","text":"Травма органів дихання, ін.","color":"#FF0000"},

				{"code":"R89","text":"Вроджена аномалія органів дихання","color":"#6666FF"},

				{"code":"R90","text":"Гіпертрофія мигдалин / аденоїди","color":"#990099"},
				{"code":"R92","text":"Новоутворення дихальної системи неуточн.","color":"#00B8D9"},
				{"code":"R95","text":"ХОЗЛ","color":"#990099"},
				{"code":"R96","text":"Астма","color":"#990099"},
				{"code":"R97","text":"Алергічний риніт","color":"#990099"},
				{"code":"R98","text":"Синдром гіпервентиляції","color":"#990099"},
				{"code":"R99","text":"Захворювання дихальної системи ін.","color":"#990099"}
			]},
			"Шкірна система":{"code":"S","data":[
				{"code":"S01","text":"Біль / болючість шкіри","color":"#00FF00"},
				{"code":"S02","text":"Свербіж","color":"#00FF00"},
				{"code":"S03","text":"Бородавки","color":"#FFFF00"},
				{"code":"S04","text":"Локалізована припухлість / набряк","color":"#00FF00"},
				{"code":"S05","text":"Генералізована припухлість / набряки","color":"#00FF00"},
				{"code":"S06","text":"Локалізований висип","color":"#00FF00"},
				{"code":"S07","text":"Генералізований висип","color":"#00FF00"},
				{"code":"S08","text":"Зміна кольору шкіри","color":"#00FF00"},

				{"code":"S09","text":"Інфекційне ураження пальців рук / ніг","color":"#FFFF00"},
				{"code":"S10","text":"Фурункул / карбункул","color":"#FFFF00"},
				{"code":"S11","text":"Шкірна інфекція посттравматична","color":"#FFFF00"},

				{"code":"S12","text":"Укус/ жало комахи","color":"#FF0000"},
				{"code":"S13","text":"Укус тварини / людини","color":"#FF0000"},
				{"code":"S14","text":"Опік","color":"#FF0000"},
				{"code":"S15","text":"Стороннє тіло в шкірі","color":"#FF0000"},
				{"code":"S16","text":"Синець / забій","color":"#FF0000"},
				{"code":"S17","text":"Подряпина/садно/пухир","color":"#FF0000"},
				{"code":"S18","text":"Рвана рана / поріз","color":"#FF0000"},
				{"code":"S19","text":"Травми шкіри інші","color":"#FF0000"},

				{"code":"S20","text":"Шкірний наріст/мозоль","color":"#00FF00"},
				{"code":"S21","text":"Текстура шкіри - симптом / скарга","color":"#00FF00"},
				{"code":"S22","text":"Ніготь - симптом / скарга","color":"#00FF00"},
				{"code":"S23","text":"Випадіння волосся / облисіння","color":"#00FF00"},
				{"code":"S24","text":"Шкіра голови - симптоми/скарга","color":"#00FF00"},
				{"code":"S26","text":"Страх захворіти на рак шкіри","color":"#00FF00"},
				{"code":"S27","text":"Страх перед захворюванням шкіри інший","color":"#00FF00"},
				{"code":"S28","text":"ОФ / Н (Р)","color":"#00FF00"},
				{"code":"S29","text":"Шкірні симптоми / скарги інші","color":"#00FF00"},

				{"code":"S70","text":"Оперізуючий герпес","color":"#FFFF00"},
				{"code":"S71","text":"Простий герпес","color":"#FFFF00"},
				{"code":"S72","text":"Короста / інші акаріази","color":"#FFFF00"},
				{"code":"S73","text":"Педикульоз /інша шкірна інвазія","color":"#FFFF00"},
				{"code":"S74","text":"Дерматофітоз","color":"#FFFF00"},
				{"code":"S75","text":"Дерматофітоз","color":"#FFFF00"},
				{"code":"S76","text":"Шкірні інфекції інші","color":"#FFFF00"},
				
				{"code":"S77","text":"Злоякісне новоутворення шкіриЛіпома","color":"#00B8D9"},
				{"code":"S78","text":"Ліпома","color":"#00B8D9"},
				{"code":"S79","text":"Новоутворення шкіри доброякісне/ неуточн.","color":"#00B8D9"},
				{"code":"S80","text":"Сонячний кератоз / опік","color":"#00B8D9"},

				{"code":"S81","text":"Гемангіома / лімфангіома","color":"#6666FF"},
				{"code":"S82","text":"Невус/родимка","color":"#6666FF"},
				{"code":"S83","text":"Вроджена аномалія шкіри інша","color":"#6666FF"},

				{"code":"S84","text":"Імпетиго","color":"#FFFF00"},

				{"code":"S85","text":"Пілонідальна кіста / свищ","color":"#990099"},
				{"code":"S86","text":"Себорейний дерматит","color":"#990099"},
				{"code":"S87","text":"Дерматит/атопічна екзема","color":"#990099"},
				{"code":"S88","text":"Контактний/алергічний дерматит","color":"#990099"},
				{"code":"S89","text":"Попрілість","color":"#990099"},
				{"code":"S90","text":"Рожевий лишай","color":"#990099"},
				{"code":"S91","text":"Псоріаз","color":"#990099"},
				{"code":"S92","text":"Захворювання потових залоз","color":"#990099"},
				{"code":"S93","text":"Атерома","color":"#990099"},
				{"code":"S94","text":"Врослий ніготь","color":"#990099"},
				{"code":"S95","text":"Контагіозний молюск","color":"#FFFF00"},
				{"code":"S96","text":"Акне","color":"#990099"},
				{"code":"S97","text":"Хронічна виразка шкіри","color":"#990099"},
				{"code":"S98","text":"Кропив'янка","color":"#990099"},
				{"code":"S99","text":"Шкірні захворювання, інші","color":"#990099"}
			]},
			"Ендокринні/метаболічні розлади та порушення харчування":{"code":"T","data":[
				{"code":"T01","text":"Надмірна спрага","color":"#00FF00"},
				{"code":"T02","text":"Надмірний апетит","color":"#00FF00"},
				{"code":"T03","text":"Втрата апетиту","color":"#00FF00"},
				{"code":"T04","text":"Проблема з годуванням немовляти/дитини","color":"#00FF00"},
				{"code":"T05","text":"Проблема з харчуванням дорослого","color":"#00FF00"},
				{"code":"T07","text":"Збільшення ваги","color":"#00FF00"},
				{"code":"T08","text":"Втрата ваги","color":"#00FF00"},
				{"code":"T10","text":"Затримка росту","color":"#00FF00"},
				{"code":"T11","text":"Зневоднення","color":"#00FF00"},
				{"code":"T26","text":"Страх захворювання на рак (Т)","color":"#00FF00"},
				{"code":"T27","text":"Страх іншого захворювання (Т)","color":"#00FF00"},
				{"code":"T28","text":"ОФ / Н (Т)","color":"#00FF00"},
				{"code":"T29","text":"Інший симптом/скарга (Т)","color":"#00FF00"},

				{"code":"T70","text":"Інфекція ендокринного органу","color":"#FFFF00"},

				{"code":"T71","text":"Злоякісне новоутворення щитовидної залози","color":"#00B8D9"},
				{"code":"T72","text":"Доброякісне новоутв. щитовидної залози","color":"#00B8D9"},
				{"code":"T73","text":"Новоутворення (Т) інші / неуточн.","color":"#00B8D9"},

				{"code":"T78","text":"Щитовидно-язичний свищ / кіста","color":"#6666FF"},
				{"code":"T80","text":"Вроджена аномалія (Т)","color":"#6666FF"},

				{"code":"T81","text":"Зоб","color":"#990099"},
				{"code":"T82","text":"Ожиріння","color":"#990099"},
				{"code":"T83","text":"Надмірна вага тіла","color":"#990099"},
				{"code":"T85","text":"Гіпертиреоїдизм / тиреотоксикоз","color":"#990099"},
				{"code":"T86","text":"Гіпотиреоїдизм / мікседема","color":"#990099"},
				{"code":"T87","text":"Гіпоглікемія","color":"#990099"},
				{"code":"T89","text":"Інсулінозалежний цукровий діабет","color":"#990099"},
				{"code":"T90","text":"Інсулінонезалежний цукровий діабет","color":"#990099"},
				{"code":"T91","text":"Дефіцит вітамінів/поживних речовин","color":"#990099"},
				{"code":"T92","text":"Подагра","color":"#990099"},
				{"code":"T93","text":"Розлад ліпідного обміну","color":"#990099"},
				{"code":"T99","text":"Інші ендокринні розлади/порушення метаболізму/харчування","color":"#990099"}
			]},
			"Урологічні":{"code":"U","data":[
				{"code":"U01","text":"Дизурія / болюче сечовипускання","color":"#00FF00"},
				{"code":"U02","text":"Часте сечовипускання / позиви","color":"#00FF00"},
				{"code":"U04","text":"Нетримання сечі","color":"#00FF00"},
				{"code":"U05","text":"Проблеми сечовипускання інші","color":"#00FF00"},
				{"code":"U06","text":"Гематурія","color":"#00FF00"},
				{"code":"U07","text":"Сеча - симптом / скарга, інші","color":"#00FF00"},
				{"code":"U08","text":"Затримка сечі","color":"#00FF00"},
				{"code":"U13","text":"Сечовий міхур - симптом / скарга, інші","color":"#00FF00"},
				{"code":"U14","text":"Нирка - симптом / скарга","color":"#00FF00"},
				{"code":"U26","text":"Страх захворіти на рак сечової системи","color":"#00FF00"},
				{"code":"U27","text":"Страх іншого захворювання (U)","color":"#00FF00"},
				{"code":"U28","text":"ОФ / Н (U)","color":"#00FF00"},
				{"code":"U29","text":"Симптом / скарга (U) інші","color":"#00FF00"},

				{"code":"U70","text":"Пієлонефрит / пієліт","color":"#FFFF00"},
				{"code":"U71","text":"Цистит / сечова інфекція інша","color":"#FFFF00"},
				{"code":"U72","text":"Уретрит","color":"#FFFF00"},

				{"code":"U75","text":"Злоякісне новоутворення нирки","color":"#00B8D9"},
				{"code":"U76","text":"Злоякісне новоутворення сечового міхура","color":"#00B8D9"},
				{"code":"U77","text":"Злоякісне новоутворення (U) інше","color":"#00B8D9"},
				{"code":"U78","text":"Доброякісне новоутворення сечових шляхів","color":"#00B8D9"},
				{"code":"U79","text":"Новоутворення сечових шляхів БДУ","color":"#00B8D9"},

				{"code":"U80","text":"Травма сечових шляхів","color":"#FF0000"},

				{"code":"U85","text":"Вроджена аномалія сечових шляхів","color":"#6666FF"},

				{"code":"U88","text":"Гломерулонефрит/нефроз","color":"#990099"},
				{"code":"U90","text":"Ортостатична альбумінурія/протеїнурія","color":"#990099"},
				{"code":"U95","text":"Сечокам'яна хвороба","color":"#990099"},
				{"code":"U98","text":"Зміни в аналізі сечі БДУ","color":"#990099"},
				{"code":"U99","text":"Захворювання сечової системи, інші","color":"#990099"}
			]},
			"Вагітність, пологи, планування сім'ї":{"code":"W","data":[
				{"code":"W01","text":"Встановлення вагітності","color":"#00FF00"},
				{"code":"W02","text":"Страх вагітності","color":"#00FF00"},
				{"code":"W03","text":"Допологова кровотеча","color":"#00FF00"},
				{"code":"W05","text":"Блювання/нудота при вагітності","color":"#00FF00"},
				{"code":"W10","text":"Посткоїтальна контрацепція","color":"#00FF00"},
				{"code":"W11","text":"Оральна контрацепція","color":"#00FF00"},
				{"code":"W12","text":"Внутрішньоматкова контрацепція","color":"#00FF00"},
				{"code":"W13","text":"Жіноча стерилізація","color":"#00FF00"},
				{"code":"W14","text":"Інша жіноча контрацепція","color":"#00FF00"},
				{"code":"W15","text":"Безпліддя/субфертильність у жінок","color":"#00FF00"},
				{"code":"W17","text":"Післяпологова кровотеча","color":"#00FF00"},
				{"code":"W18","text":"Післяпологові симптом/скарга інші","color":"#00FF00"},
				{"code":"W19","text":"Груди/лактація симптом скарга","color":"#00FF00"},
				{"code":"W21","text":"Стурбованість виглядом під час вагітності","color":"#00FF00"},
				{"code":"W27","text":"Страх ускладнення вагітності","color":"#00FF00"},
				{"code":"W28","text":"ОФ / Н (W)","color":"#00FF00"},
				{"code":"W29","text":"Симптом/скарга, пов'язані з вагітністю ін.","color":"#00FF00"},

				{"code":"W70","text":"Післяпологова інфекція/сепсис","color":"#FFFF00"},
				{"code":"W71","text":"Інфекція, що ускладнює вагітність","color":"#FFFF00"},

				{"code":"W72","text":"Злоякісне новоутв., пов'язане з вагітністю","color":"#00B8D9"},
				{"code":"W73","text":"Доброяк./неуточ. новоутв. пов'язане з вагітн.","color":"#00B8D9"},

				{"code":"W75","text":"Травма, що ускладнює вагітність","color":"#FF0000"},

				{"code":"W76","text":"Вроджена аномалія, що ускладнює вагітність","color":"#6666FF"},

				{"code":"W78","text":"Вагітність","color":"#990099"},
				{"code":"W78","text":"Небажана вагітність","color":"#990099"},
				{"code":"W80","text":"Ектопічна вагітність","color":"#990099"},
				{"code":"W81","text":"Токсикоз при вагітності","color":"#990099"},
				{"code":"W82","text":"Спонтанний аборт","color":"#990099"},
				{"code":"W83","text":"Індукований аборт","color":"#990099"},
				{"code":"W84","text":"Вагітність високого ризику","color":"#990099"},
				{"code":"W85","text":"Гестаційний діабет","color":"#990099"},
				{"code":"W90","text":"Пологи без ускладнень/живонароджений","color":"#990099"},
				{"code":"W91","text":"Пологи без ускладнень/мертвонароджений","color":"#990099"},
				{"code":"W92","text":"Пологи з ускладненнями/живонароджений","color":"#990099"},
				{"code":"W93","text":"Пологи з ускладненнями/мертвонароджений","color":"#990099"},
				{"code":"W94","text":"Післяпологовий мастит","color":"#990099"},
				{"code":"W95","text":"Захв. грудей під час вагітності/післяпол, інші","color":"#990099"},
				{"code":"W96","text":"Ускладнення в післяпологовому періоді, інші","color":"#990099"},
				{"code":"W99","text":"Захворювання під час вагітності/пологів, інші","color":"#990099"}
			]},
			"Жіночі статеві органи":{"code":"X","data":[
				{"code":"X01","text":"Генітальний біль у жінки","color":"#00FF00"},
				{"code":"X02","text":"Менструальний біль","color":"#00FF00"},
				{"code":"X03","text":"Міжменструальний біль","color":"#00FF00"},
				{"code":"X04","text":"Біль під час статевого акту у жінки","color":"#00FF00"},
				{"code":"X05","text":"Відсутність/мізерні менструації","color":"#00FF00"},
				{"code":"X06","text":"Надмірна менструація","color":"#00FF00"},
				{"code":"X07","text":"Нерегулярні/часті менструації","color":"#00FF00"},
				{"code":"X08","text":"Міжменструальні кровотечі","color":"#00FF00"},
				{"code":"X09","text":"Передменструальні симптоми/скарги","color":"#00FF00"},
				{"code":"X10","text":"Затримка очікуваної менструації","color":"#00FF00"},
				{"code":"X11","text":"Симптом/скарга, пов'язаний з менопаузою","color":"#00FF00"},
				{"code":"X12","text":"Постменопаузальна кровотеча","color":"#00FF00"},
				{"code":"X13","text":"Посткоїтальна кровотеча","color":"#00FF00"},
				{"code":"X14","text":"Вагінальні виділення","color":"#00FF00"},
				{"code":"X15","text":"Інші вагінальні симптоми/скарги","color":"#00FF00"},
				{"code":"X16","text":"Піхвові симптоми/скарги","color":"#00FF00"},
				{"code":"X17","text":"Тазові симптоми/скарги","color":"#00FF00"},
				{"code":"X18","text":"Біль у молочній залозі","color":"#00FF00"},
				{"code":"X19","text":"Пухлина/новоутворення у молочній залозі","color":"#00FF00"},
				{"code":"X20","text":"Симптом/скарга, пов'язаний з соском мол.зал","color":"#00FF00"},
				{"code":"X21","text":"Інший симптом/скарга, пов'язаний з мол. зал.","color":"#00FF00"},
				{"code":"X22","text":"Стурбованість зовнішнім виглядом мол. зал.","color":"#00FF00"},
				{"code":"X23","text":"Страх ЗПСШ у жінок","color":"#00FF00"},
				{"code":"X24","text":"Страх сексуальної дисфункції у жінок","color":"#00FF00"},
				{"code":"X25","text":"Страх захворювання на рак статевих органів","color":"#00FF00"},
				{"code":"X26","text":"Страх захворювання на рак молочної залози","color":"#00FF00"},
				{"code":"X27","text":"Страх інших хвороб жін. статевих органів","color":"#00FF00"},
				{"code":"X28","text":"ОФ / Н (F)","color":"#00FF00"},
				{"code":"X29","text":"Генітальні симптоми/скарги у жінок, інші","color":"#00FF00"},

				{"code":"X70","text":"Сифіліс у жінок","color":"#FFFF00"},
				{"code":"X71","text":"Гонорея у жінок","color":"#FFFF00"},
				{"code":"X72","text":"Генітальний кандидоз у жінок","color":"#FFFF00"},
				{"code":"X73","text":"Генітальний трихомоніаз у жінок","color":"#FFFF00"},
				{"code":"X74","text":"Запалення тазових органів","color":"#FFFF00"},

				{"code":"X75","text":"Злоякісні новоутворення шийки матки","color":"#00B8D9"},
				{"code":"X76","text":"Злоякісні новоутворення молочної залози","color":"#00B8D9"},
				{"code":"X77","text":"Злоякісні генітальні новоутв. (X) інші","color":"#00B8D9"},
				{"code":"X78","text":"Фіброміома матки","color":"#00B8D9"},
				{"code":"X79","text":"Доброякісні новоутв. молочної залози","color":"#00B8D9"},
				{"code":"X80","text":"Доброякісні новоутв. молочної залози","color":"#00B8D9"},
				{"code":"X81","text":"Інші/неуточнені генітальні новоутворення","color":"#00B8D9"},

				{"code":"X82","text":"Травми жіночих статевих органів","color":"#FF0000"},

				{"code":"X83","text":"Вроджена аномалія статевих органів (X)","color":"#6666FF"},

				{"code":"X84","text":"Вагініт/вульвіт БДУ","color":"#990099"},
				{"code":"X85","text":"Захворювання шийки матки БДУ","color":"#990099"},
				{"code":"X86","text":"Анормальний мазок з шийки матки","color":"#990099"},
				{"code":"X87","text":"Матково-піхвовий пролапс","color":"#990099"},
				{"code":"X88","text":"Фіброзно-кістозна хвороба молочн. залоз","color":"#990099"},
				{"code":"X89","text":"Синдром передменструальної напруги","color":"#990099"},
				{"code":"X90","text":"Генітальний герпес у жінок","color":"#FFFF00"},
				{"code":"X91","text":"Гострі кондиломи у жінок","color":"#FFFF00"},
				{"code":"X92","text":"Хламідіоз статевих органів у жінок","color":"#FFFF00"},
				{"code":"X99","text":"Інші захворювання статевих органів (X)","color":"#990099"}
			]},
			"Чоловічі статеві органи":{"code":"Y","data":[
				{"code":"Y01","text":"Біль у статевому члені","color":"#00FF00"},
				{"code":"Y02","text":"Біль в яєчках/мошонці","color":"#00FF00"},
				{"code":"Y03","text":"Виділення з сечовипускного каналу","color":"#00FF00"},
				{"code":"Y04","text":"Виділення з сечовипускного каналу","color":"#00FF00"},
				{"code":"Y05","text":"Яєчки/мошонка симптоми/скарги, інші","color":"#00FF00"},
				{"code":"Y06","text":"Простата симптоми/скарги","color":"#00FF00"},
				{"code":"Y07","text":"Імпотенція БДУ","color":"#00FF00"},
				{"code":"Y08","text":"Сексуальна функція симптоми/скарги","color":"#00FF00"},
				{"code":"Y10","text":"Безпліддя/субфертильність у чоловіків","color":"#00FF00"},
				{"code":"Y13","text":"Стерилізація у чоловіків","color":"#00FF00"},
				{"code":"Y14","text":"Інші методи планування сім'ї для чолов.","color":"#00FF00"},
				{"code":"Y16","text":"Груд. зал. у чоловіків симптоми/скарги","color":"#00FF00"},
				{"code":"Y24","text":"Страх сексуальної дисфункції у чолов.","color":"#00FF00"},
				{"code":"Y25","text":"Страх ЗПСШ у чоловіків","color":"#00FF00"},
				{"code":"Y26","text":"Страх захворювання на рак стат. орг. (Y)","color":"#00FF00"},
				{"code":"Y27","text":"Страх інших захворювань стат. орг. (Y)","color":"#00FF00"},
				{"code":"Y28","text":"ОФ / Н (Y)","color":"#00FF00"},
				{"code":"Y29","text":"Інші симптоми/скарги стат. орг. (Y)","color":"#00FF00"},

				{"code":"Y70","text":"Сифіліс у чоловіків","color":"#FFFF00"},
				{"code":"Y71","text":"Гонорея у чоловіків","color":"#FFFF00"},
				{"code":"Y72","text":"Генітальний герпес у чоловіків","color":"#FFFF00"},
				{"code":"Y73","text":"Простатит/везикуліт","color":"#FFFF00"},
				{"code":"Y74","text":"Орхіт/епідидиміт","color":"#FFFF00"},
				{"code":"Y75","text":"Баланіт","color":"#FFFF00"},
				{"code":"Y76","text":"Гострі кондиломи у чоловіків","color":"#FFFF00"},

				{"code":"Y77","text":"Злоякісне новоутворення простати","color":"#00B8D9"},
				{"code":"Y78","text":"Злоякісне новоутворення (Y) інше","color":"#00B8D9"},
				{"code":"Y79","text":"Доброякісне/неуточн. новоутворення (Y)","color":"#00B8D9"},

				{"code":"Y80","text":"Травми чоловічих статевих органів","color":"#FF0000"},

				{"code":"Y81","text":"Фімоз/надмірна крайня плоть","color":"#6666FF"},
				{"code":"Y82","text":"Гіпоспадія","color":"#6666FF"},
				{"code":"Y83","text":"Неопущення яєчка","color":"#6666FF"},
				{"code":"Y84","text":"Вродж. аномалія стат. органів (Y) інша","color":"#6666FF"},

				{"code":"Y85","text":"Доброякісна гіперплазія простати","color":"#990099"},
				{"code":"Y86","text":"Водянка яєчка","color":"#990099"},
				{"code":"Y99","text":"Інші захворювання статевих органів (Y)","color":"#990099"}
			]},
			"Соціальні проблеми":{"code":"Z","data":[
				{"code":"Z01","text":"Бідність/фінансова проблема","color":"#00FF00"},
				{"code":"Z02","text":"Проблема з харчами/водою","color":"#00FF00"},
				{"code":"Z03","text":"Проблема з житлом /районом проживання","color":"#00FF00"},
				{"code":"Z04","text":"Соціально-культурна проблема","color":"#00FF00"},
				{"code":"Z05","text":"Проблема з роботою","color":"#00FF00"},
				{"code":"Z06","text":"Проблема безробіття","color":"#00FF00"},
				{"code":"Z07","text":"Проблема з освітою","color":"#00FF00"},
				{"code":"Z08","text":"Проблема з соціальним забезпеченням","color":"#00FF00"},
				{"code":"Z09","text":"Юридична проблема","color":"#00FF00"},
				{"code":"Z10","text":"Проблема з системою охорони здоров'я","color":"#00FF00"},
				{"code":"Z11","text":"Проблема прихильності до лікування","color":"#00FF00"},
				{"code":"Z12","text":"Проблема відносин із партнером","color":"#00FF00"},
				{"code":"Z13","text":"Проблема з поведінкою партнера","color":"#00FF00"},
				{"code":"Z14","text":"Проблема пов'язана з хворобою партнера","color":"#00FF00"},
				{"code":"Z15","text":"Проблема з втратою/смертю партнера","color":"#00FF00"},
				{"code":"Z16","text":"Проблема відносин з дитиною","color":"#00FF00"},
				{"code":"Z18","text":"Проблема, пов'язана з хворобою дитини","color":"#00FF00"},
				{"code":"Z19","text":"Проблема, пов'язана з хворобою дитини","color":"#00FF00"},
				{"code":"Z20","text":"Проблема відносин з батьками/сім'єю","color":"#00FF00"},
				{"code":"Z21","text":"Проблема поведінки з батьками/сім'єю","color":"#00FF00"},
				{"code":"Z22","text":"Проблема з хворобою батьків/члена сім'ї","color":"#00FF00"},
				{"code":"Z23","text":"Втрата/смерть батьків/члена сім'ї","color":"#00FF00"},
				{"code":"Z24","text":"Проблема відносин з другом","color":"#00FF00"},
				{"code":"Z25","text":"Проблема з нападом/небезпечною подією","color":"#00FF00"},
				{"code":"Z27","text":"Страх перед соціальною проблемою","color":"#00FF00"},
				{"code":"Z28","text":"ОФ / Н (Z)","color":"#00FF00"},
				{"code":"Z29","text":"Соціальна проблема БДУ","color":"#00FF00"}
			]}}
		# Таблица с направлениями
		self.table2 = [
				{"code":"30", "text":"Повне медичне обстеження", "color":self.gray},
				{"code":"31", "text":"Часткове медичне обстеження", "color":self.gray},
				{"code":"32", "text":"Тест на чутливість", "color":self.gray},
				{"code":"33", "text":"Імунологічний тест", "color":self.gray},
				{"code":"34", "text":"Аналіз крові", "color":self.gray},
				{"code":"35", "text":"Аналіз сечі", "color":self.gray},
				{"code":"36", "text":"Аналіз калу", "color":self.gray},
				{"code":"37", "text":"Гістологія/Цитологія", "color":self.gray},
				{"code":"38", "text":"Інші дослідження НКІ", "color":self.gray},
				{"code":"39", "text":"Дослідження фізичних функцій", "color":self.gray},
				{"code":"40", "text":"Діагностична ендоскопія", "color":self.gray},
				{"code":"41", "text":"Діагностична радіологія", "color":self.gray},
				{"code":"42", "text":"Запис ел. потенціалів (ЕКГ, ін.)", "color":self.gray},
				{"code":"43", "text":"Інші діагностичні процедури", "color":self.gray},
				{"code":"44", "text":"Імунізація/профілактичне лікування", "color":self.gray},
				{"code":"45", "text":"Нагляд/навчання/консультація/дієта", "color":self.gray},
				{"code":"46", "text":"Консультація з лікарем ПМСД", "color":self.gray},
				{"code":"47", "text":"Консультація зі спеціалістом", "color":self.gray},
				{"code":"48", "text":"Уточнення/обговорення причини звернення", "color":self.gray},
				{"code":"49", "text":"Інші профілактичні процедури", "color":self.gray},
				{"code":"50", "text":"Призначення ліків/ін’єкції", "color":self.gray},
				{"code":"51", "text":"Розсічення /дренаж/промивання/аспірація", "color":self.gray},
				{"code":"52", "text":"Видалення тканини /біопсія/санація", "color":self.gray},
				{"code":"53", "text":"Катетеризація / інтубація / дилатація", "color":self.gray},
				{"code":"54", "text":"Відновлення /накладання шву / гіпсу /протез", "color":self.gray},
				{"code":"55", "text":"Місцеві ін'єкції / інфільтрація", "color":self.gray},
				{"code":"56", "text":"Перев'язка/пов'язка/тампонада", "color":self.gray},
				{"code":"57", "text":"Фізична медицина/ реабілітація", "color":self.gray},
				{"code":"58", "text":"Психотерапія", "color":self.gray},
				{"code":"59", "text":"Інші терапевтичні процедури НКІ", "color":self.gray},
				{"code":"60", "text":"Результати тестів / процедур", "color":self.gray},
				{"code":"61", "text":"Результати обстеж./тестів від ін. організацій", "color":self.gray},
				{"code":"62", "text":"Адміністративна робота", "color":self.gray},
				{"code":"63", "text":"Невизначене звернення", "color":self.gray},
				{"code":"64", "text":"Звернення, ініційоване медпрацівником", "color":self.gray},
				{"code":"65", "text":"Звернення, ініційоване третьою особою", "color":self.gray},
				{"code":"66", "text":"Направлення до ін. працівника (не лікаря)", "color":self.gray},
				{"code":"67", "text":"Направлення до ін. лікаря/спеціаліста/лікарні", "color":self.gray},
				{"code":"68", "text":"Інші направлення НКІ", "color":self.gray},
				{"code":"69", "text":"Інша причина звернення НКІ", "color":self.gray}
			]
		# Пары {"Параметр":"Код"}
		self.dataAndCode = {}
		# Пары {"Код":"Параметр"}
		self.codeAndData = {}

		# Локализации болезней
		# self.localization = list(self.table1.keys())
		self.localization = {}
		for k in self.table1:
			self.localization[k] = self.table1[k]["code"]
			for p in self.table1[k]["data"]:
				# Структура p - {'code':'A00', 'text':'Біль', 'color':'#000000'}
				self.dataAndCode[p["text"]] = p
				self.codeAndData[p["code"]] = p

	def _setCode(self, code):
		local = self.table2.copy()
		for l in local:
			l["code"] = code + l["code"][-2:]
		return local

	def getCode(self, data):
		return self.dataAndCode.get(data, "")["code"]

	def getTypeByCode(self, code):
		types = self.codeAndData.get(code, None)
		if not types:
			return 2
		# types = self.codeAndData[code]
		if types["color"] == self.green:
			return 0
		else:
			return 1

	def getParamByLoc(self, loc=None):
		res = []
		if loc:
			code = self.localization[loc]
			ways = self._setCode(code)
			for w in ways:
				res.append(w)
			for p in self.table1[loc]["data"]:
				res.append(p)
		else:
			for k in self.table1:
				for p in self.table1[k]["data"]:
					res.append(p)
		return res

	def getParamByLocalization(self, localization=None):
		res = []
		if localization:
			for p in self.table1[localization]["data"]:
				res.append(p["text"])
			return res
		else:
			for k in self.table1:
				for p in self.table1[k]["data"]:
					res.append(p["text"])
			return res

	def getLocalization(self):
		return list(self.localization.keys())

if __name__ == '__main__':
	table = DataTable()
	print(table.getLocalization())
	print(table.codeAndData["A01"], sep="\n\n")